Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: ནམ་མཁའ་ལྟ་བུའི་ཡེ་ཤེས་མངོན་པར་འཚལ་བ་རྣམས་ཀྱིས་ནི་ཅི་ཡང་མ་མཆིས་པ་བརྗོད་པ་དང་།
en: May those who long for the knowledge that is like space understand it to be giving the teaching on nothingness. “ ‘

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པ་རྣམས་ཀྱིས་ནི་ཡོངས་སུ་དག་པ་ལ་རབ་ཏུ་འགོད་པ་བརྗོད་པ་དང་།
en: May those who have completed the perfections understand the Dharma that is taught to be giving the teaching on the foundation that is completely pure.

source: བསྡུ་བའི་དངོས་པོ་ཡོངས་སུ་མ་རྫོགས་པ་རྣམས་ཀྱིས་ནི་ཤིན་ཏུ་ཡང་དག་པར་གཟུང་བ་བརྗོད་པ་དང་།
en: May those who have not perfected the activities that gather beings understand it to be giving the teaching on having been well gathered.

source: ཚངས་པའི་གནས་པ་ཚོལ་བ་རྣམས་ཀྱིས་ནི་སྦྱོར་བ་མཉམ་པ་བརྗོད་པ་དང་།
en: May those who are seeking the brahmavihāras understand it to be giving the teaching on equal application.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་རིན་པོ་ཆེ་ཡོངས་སུ་མ་རྫོགས་པ་རྣམས་ཀྱིས་ནི་རྣམ་པར་གནས་པས་ངེས་པར་འབྱུང་བ་བརྗོད་པ་དང་།
en: May those who have not perfected the precious factors for enlightenment understand it to be giving the teaching on steadfast dedication to liberation.

source: ཤེས་པ་མ་བསྒོམས་ཤིང་རབ་ཏུ་སྡང་བའི་སེམས་དང་ལྡན་པ་རྣམས་ཀྱིས་ནི་རྒྱ་མཚོའི་ཕྱག་རྒྱ་བརྗོད་པ་དང་།
en: May those who have forgotten the wisdom that was well taught understand it to be giving the teaching on the symbol of the ocean.

source: མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་ངོ་མཚར་དུ་སེམས་པ་རྣམས་ཀྱིས་ནི་སེམས་མ་མཆིས་པ་བརྗོད་པ་དང་།
en: May those who are astonished by the forbearance that comes from realizing the birthlessness of phenomena understand it to be giving the teaching that there is no mind.

source: ཇི་ལྟར་ཐོས་པའི་ཆོས་རབ་ཏུ་ཉམས་པའི་སེམས་དང་ལྡན་པ་རྣམས་ཀྱིས་ནི་བསྐྱུད་པ་མ་མཆིས་པ་བརྗོད་པ་དང་།
en: May those who have forgotten the Dharma they have heard understand it to be giving the teaching on there being no loss of what one has heard.

source: ཕན་ཚུན་ལེགས་པར་སྨྲས་པ་ལ་མི་དགའ་བ་རྣམས་ཀྱིས་ནི་རབ་རིབ་མ་མཆིས་པ་བརྗོད་པ་དང་།
en: May those who are displeased by each other’s good advice understand it to be giving the teaching on having no clouded vision. “ ‘

source: དཀོན་མཆོག་གསུམ་ལ་རབ་ཏུ་དང་བ་ཐོབ་པ་རྣམས་ཀྱིས་ནི་བསོད་ནམས་ཆེ་བ་བརྗོད་པ་དང་།
en: May those who have not gained faith in the Three Jewels understand the Dharma that is taught to be giving the teaching on the increase of merit.

source: ཆོས་ཀྱི་སྒོའི་ཆར་རབ་ཏུ་འབབ་པས་ཆོག་མ་འཚལ་བ་རྣམས་ཀྱིས་ནི་ཆོས་ཀྱི་སྤྲིན་བརྗོད་པ་དང་།
en: May those who are not satisfied by a rainfall of Dharma entranceways understand it to be giving the teaching on the rainclouds of the Dharma.

source: དཀོན་མཆོག་གསུམ་རྒྱུན་ཆད་པར་ལྟ་བ་རྣམས་ཀྱིས་ནི་རིན་ཆེན་བཀོད་པ་བརྗོད་པ་དང་།
en: May those who hold the view that the Three Jewels have ceased to exist understand it to be giving the teaching the display of jewels.

source: ཤེས་པ་ཉམས་པའི་ལས་ལ་མངོན་པར་བརྩོན་པ་རྣམས་ཀྱིས་ནི་དཔེ་མ་མཆིས་པ་བརྗོད་པ་དང་།
en: May those who engage in activities bereft of knowledge understand it to be giving the teaching on the incomparable.

source: ཀུན་ཏུ་སྦྱོར་བ་དང་འཆིང་བ་ཅན་ཐམས་ཅད་ཀྱིས་ནི་ནམ་མཁའི་སྒོ་བརྗོད་པ་དང་།
en: May those who are bound by all the fetters understand it to be giving the teaching on the entrance into the sky.

source: ཆོས་ཐམས་ཅད་གཞན་མ་ལགས་པར་སེམས་པ་རྣམས་ཀྱིས་ནི་ཡེ་ཤེས་ཀྱི་ཕྱག་རྒྱ་བརྗོད་པ་དང་།
en: May those who think that the Dharma teachings are all the same understand it to be giving the teaching on the seal of wisdom.

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ཡོངས་སུ་མ་རྫོགས་པ་རྣམས་ཀྱིས་ནི་འཇིག་རྟེན་གྱི་རིག་པ་མངོན་སུམ་དུ་བགྱི་བའི་དངོས་པོ་བརྗོད་པ་དང་།
en: May those who have not completed the qualities of a tathāgata understand it to be giving the teaching on that which is not directly perceived by mundane knowledge.

source: སྔོན་གྱི་སངས་རྒྱས་ལ་ལྷག་པར་བགྱི་བ་བགྱིས་པ་རྣམས་ཀྱིས་ནི་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་བརྗོད་པ་དང་།
en: May those who have not served previous buddhas well understand it to be giving the teaching on definitive miracles.

source: ཕྱི་མའི་མཐའི་བསྐལ་པར་ཆོས་ཀྱི་སྒོ་གཅིག་སྟོན་པ་རྣམས་ཀྱིས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་བརྗོད་པ་དང་།
en: May those who have taught one Dharma entranceway at the end of the eon understand it to be giving the teaching on the way of all Dharma teachings.

source: མདོ་སྡེ་ཐམས་ཅད་ལ་རྣམ་པར་ངེས་པ་རྣམས་ཀྱིས་ནི་ཆོས་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་དུ་རྣམ་པར་ངེས་པ་བརྗོད་པ་དང་། རྙིང་པར་འགྱུར་བ་དང་།
en: May those who have conviction in all the sūtras understand it to be giving the teaching on the sameness of the nature of all phenomena.

source: འཐུན་པའི་ཆོས་དྲུག་ཡོངས་སུ་སྤངས་པ་རྣམས་ཀྱིས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་བརྗོད་པ་དང་།
en: May those who have forsaken the six conducive qualities understand it to be giving the teaching on the way of all phenomena. “ ‘

source: རྣམ་པར་ཐར་པའི་སེམས་ཀྱི་ཐེག་པ་ལ་མངོན་པར་བརྩོན་པ་རྣམས་ཀྱིས་ནི་མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་བ་བརྗོད་པ་དང་།
en: May those who are committed to the motivation to attain liberation understand the Dharma that is taught to be giving the teaching on the play of clairvoyances.

source: དེ་བཞིན་གཤེགས་པའི་གསང་བའི་རྗེས་སུ་འཇུག་པ་ལ་རྣམ་པར་རྟོག་པ་རྣམས་ཀྱིས་ནི་གཞན་གྱི་དྲིང་མི་འཇོག་པ་བརྗོད་པ་དང་།
en: May those who consider entering into the secret of the tathāgatas understand it to be giving the teaching on nondependence on others.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་མངོན་པར་མི་བརྩོན་པ་རྣམས་ཀྱིས་ནི་ཡེ་ཤེས་ཐོབ་པར་བརྗོད་པ་དང་།
en: May those who are not engaged in the conduct of a bodhisattva understand it to be speaking about the attainment of wisdom.

source: ཉེ་དུ་ལ་ཡང་དག་པར་རྟོན་པ་རྣམས་ཀྱིས་ནི་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་བརྗོད་པ་དང་།
en: May those who have the outlook of longing for family understand it to be giving the teaching on following everyone.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལྷག་མ་དང་བཅས་པ་རྣམས་ཀྱིས་ནི་དབང་བསྐུར་བ་བརྗོད་པ་དང་།
en: May those who have not completed the conduct of the bodhisattva understand it to be giving the teaching on consecration.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡོངས་སུ་མ་རྫོགས་པ་རྣམས་ཀྱིས་ནི་མི་ཆོམས་པ་བརྗོད་པ་དང་།
en: May those who have not completed the ten strengths of a tathāgata understand it to be giving the teaching on invincibility.

source: མི་འཇིགས་པ་བཞི་མ་ཐོབ་པ་རྣམས་ཀྱིས་ནི་མི་ཟད་པ་བརྗོད་པ་དང་།
en: May those who have not attained the four fearlessnesses understand it to be giving the teaching on inexhaustibility.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་མ་ཐོབ་པ་རྣམས་ཀྱིས་ནི་མི་འཕྲོགས་པ་བརྗོད་པ་དང་།
en: May those who have not attained the distinct qualities of a buddha understand it to be giving the teaching on inviolability.

source: མཉན་པ་དང་ལྟ་བ་དོན་མ་མཆིས་པ་རྣམས་ཀྱིས་ནི་སྨོན་ལམ་བརྗོད་པ་དང་།
en: May those whose listening and seeing are not unfailing understand it to be giving the teaching on prayer.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་སུམ་དུ་རྗེས་སུ་རྟོགས་པར་བགྱི་བའི་སླད་དུ་རྒྱུན་འཁྲུགས་པ་རྣམས་ཀྱིས་ནི་རྒྱ་མཚོ་དྲི་མ་མེད་པ་བརྗོད་པ་དང་།
en: May those who through discontinuity do not understand all the Dharma entranceways of the Buddha understand it to be giving the teaching on the stainless ocean.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལྷག་མ་དང་བཅས་པ་རྣམས་ཀྱིས་ནི་སངས་རྒྱས་ཤིན་ཏུ་རྣམ་པར་སངས་རྒྱས་པ་བརྗོད་པ་དང་།
en: May those whose omniscient wisdom is incomplete understand it to be giving the teaching on the complete buddhahood of a buddha.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དགོངས་པ་མ་ཐོབ་པ་རྣམས་ཀྱིས་ནི་མཐའ་མ་མཆིས་པ་དང་། ཐུག་པ་མ་མཆིས་པ་བརྗོད་པས་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གཡོ་མ་མཆིས་པ།
en: May those who have not attained that which is intended by all the tathāgatas understand the Dharma that is taught to be giving the teaching on reaching the furthest limit. “ ‘

source: སྒྱུ་མ་མཆིས་པ། དྲང་བ་དྲང་བའི་རང་བཞིན་ཅན་ཏེ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དེ་དག་གི་སེམས་ཀྱི་རྒྱུད་ལ་ཚིག་གཅིག་གིས་བརྗོད་པས་ཀྱང་ཆོས་ཀྱི་སྒོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། གཟུངས་བདུན་ཁྲི་ལྔ་སྟོང་པོའི་ཡོན་ཏན་དེ་དག་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །
en: May I, through speaking one word to the countless, innumerable bodhisattvas who are not deceitful, who are not deceptive, who are upright and are of an upright nature, and who have truly entered the Mahāyāna, establish in their minds these qualities of 84,000 doors of the Dharma, 84,000 doors of samādhis, and 75,000 doors of dhāraṇīs.

source: དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་གོ་ཆ་ཆེན་པོ་འཚལ་བར་གྱུར་ཅིག །
en: Through that, may the bodhisattva mahāsattvas become armored with the great armor.

source: སྨོན་ལམ་གྱི་ཁྱད་པར་བསམ་གྱིས་མི་ཁྱབ་པས་མངོན་པར་འཕགས་པར་གྱུར་ཅིག །
en: May they rise higher through inconceivably special prayers.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་ཡེ་ཤེས་མཐོང་བ་དང་། བྱང་ཆུབ་ཀྱི་ཡོན་ཏན་དམ་པས་བརྒྱན་པར་གྱུར་ཅིག །འདི་ལྟ་སྟེ།
en: May they become adorned with the vision of inconceivable knowledge and the sublime qualities of enlightenment.

source: ལུས་མཚན་དང་དཔེ་བྱད་རྣམས་ཀྱིས་བརྒྱན་པར་གྱུར་ཅིག །
en: This means may their bodies become adorned with the signs and indications of great beings.

source: ངག་ལེགས་པར་སྨྲས་པས་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡང་དག་པར་མགུ་བར་བགྱིད་པས་བརྒྱན་པར་གྱུར་ཅིག །
en: May they become adorned with excellent speech so that through such speech they satisfy beings in accord with their dispositions.

source: ཏིང་ངེ་འཛིན་ཚིག་མ་མཆིས་པའི་སླད་དུ་ཐོས་པས་བརྒྱན་པ་དང་།
en: May they become adorned with learning for the sake of wordless samādhi.

source: གཟུངས་བསྐྱུད་པ་མ་མཆིས་པའི་སླད་དུ་དྲན་པས་བརྒྱན་པ་དང་།
en: May they become adorned with recollection so that they will have mental retention that is never lost.

source: འགྲོ་བ་ངན་པ་ཁོང་དུ་ཆུད་པའི་སླད་དུ་ཡིད་ཀྱིས་བརྒྱན་ཅིང་མྱ་ངན་ལས་འདས་པས་བརྒྱན་པ་དང་།
en: May they become adorned with a virtuous mind and adorned with nirvāṇa so that they have a definite understanding of wrong paths.

source: དམ་བཅས་པ་ལ་བརྟན་པའི་སླད་དུ་བསམ་པས་བརྒྱན་པ་དང་།
en: May they become adorned with motivation so that they have firm vows.

source: དམ་བཅས་པ་ཉམས་སུ་ལོན་པའི་སླད་དུ་སྦྱོར་བས་བརྒྱན་པ་དང་།
en: May they become adorned with application so that they carry out their vows.

source: ས་ནས་སར་འཕར་བའི་སླད་དུ་ལྷག་པའི་བསམ་པས་བརྒྱན་པ་དང་།
en: May they become adorned with altruistic motivation so that they ascend from level to level.

source: དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སླད་དུ་སྦྱིན་པས་བརྒྱན་པ་དང་།
en: May they become adorned with generosity so that they give away everything.

source: ལེགས་པར་ཐོས་པ་ཁོང་དུ་ཆུད་པ་དྲི་མ་མ་མཆིས་པའི་སླད་དུ་ཚུལ་ཁྲིམས་ཀྱིས་བརྒྱན་པ་དང་།
en: May they become adorned with good conduct so that they are stainless in what was well listened to and understood.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་འགྲས་པའི་སེམས་མ་མཆིས་པའི་སླད་དུ་བཟོད་པས་བརྒྱན་པ་དང་།
en: May they become adorned with patience so that they have no hostility toward any being.

source: ཚོགས་ཐམས་ཅད་ཉེ་བར་བསྩགས་པའི་སླད་དུ་བརྩོན་འགྲུས་ཀྱིས་བརྒྱན་པ་དང་།
en: May they become adorned with diligence so that they gather all the accumulations.

source: སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་དང་། མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་བའི་སླད་དུ། བསམ་གཏན་གྱིས་བརྒྱན་པ་དང་།
en: May they become adorned with meditation so that they enjoy all meditation states and the clairvoyances.

source: ཉོན་མོངས་པའི་བག་ཆགས་ཡོངས་སུ་འཚལ་བའི་སླད་དུ་ཤེས་རབ་ཀྱིས་བརྒྱན་པར་གྱུར་ཅིག །
en: May they become adorned with wisdom so that they understand completely the latencies of kleśas.

source: སེམས་ཅན་ཐམས་ཅད་ཡང་དག་པར་སྐྱོབ་པའི་རྗེས་སུ་མཆིས་པའི་སླད་དུ་བྱམས་པས་བརྒྱན་པ་དང་།
en: May they become adorned with kindness so they take care of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བ་ལ་གནས་པའི་སླད་དུ་སྙིང་རྗེས་བརྒྱན་པ་དང་།
en: May they become adorned with compassion so that they never abandon beings.

source: ཆོས་ཐམས་ཅད་ལ་ཐེ་ཙོམ་མ་མཆིས་པར་འགྱུར་བའི་སླད་དུ་དགའ་བས་བརྒྱན་པ་དང་།
en: May they become adorned with rejoicing so that they never have doubts about any teachings.

source: མཐོན་དམན་གཉིས་དང་བྲལ་བའི་སླད་དུ་བཏང་སྙོམས་ཀྱིས་བརྒྱན་པ་དང་།
en: May they become adorned with impartiality so that they make no distinction between superior and inferior.

source: མངོན་པར་ཤེས་པ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་རྩེ་བའི་སླད་དུ་མངོན་པར་ཤེས་པས་བརྒྱན་པ་དང་།
en: May they become adorned with clairvoyance so that they enjoy all clairvoyances. “ ‘

source: ལོངས་སྤྱོད་མི་བས་པའི་རིན་པོ་ཆེའི་ལག་པ་ཐོབ་པའི་སླད་དུ་བསོད་ནམས་ཀྱིས་བརྒྱན་པ་དང་།
en: May they become adorned with merit so that they obtain in their hands the jewel of unending enjoyments.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་མངོན་པར་འཚལ་བའི་སླད་དུ་ཡེ་ཤེས་ཀྱིས་བརྒྱན་པ་དང་།
en: May they become adorned with knowledge so that they fully understand the workings of the minds of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཆོས་རྟོགས་པར་བགྱི་བ་ལ་མཁས་པའི་སླད་དུ་བློས་བརྒྱན་པ་དང་།
en: May they become adorned with intelligence so that they are skilled in making all beings understand the Dharma.

source: ཤེས་རབ་ཀྱི་མིག་གི་སྣང་བ་ཐོབ་པའི་སླད་དུ་སྣང་བས་བརྒྱན་པར་གྱུར་ཅིག །དོན་དང་།
en: May they become adorned with light so that they attain the light of the eyes of wisdom.

source: ཆོས་དང་། ངེས་པའི་ཚིག་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པའི་སླད་དུ་སོ་སོ་ཡང་དག་པར་རིག་པས་བརྒྱན་པར་གྱུར་ཅིག །
en: May they become adorned with analytical knowledge so that they gain the analytical knowledges of meanings, Dharma teachings, definitions, and eloquence.

source: བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་ཟིལ་གྱིས་མི་ནོན་པའི་སླད་དུ་མི་འཇིགས་པས་བརྒྱན་པ་དང་།
en: May they become adorned with fearlessness so that they are not overcome by opposing disputers or any māras.

source: སངས་རྒྱས་རྣམས་ཀྱི་ཡོན་ཏན་རྗེས་སུ་ཐོབ་པའི་སླད་དུ་ཡོན་ཏན་གྱིས་བརྒྱན་པ་དང་།
en: May they become adorned with qualities so that they attain the qualities of the buddhas.

source: རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ཐོགས་པ་མ་མཆིས་པའི་སྤོབས་པས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པའི་སླད་དུ་ཆོས་ཀྱིས་བརྒྱན་པར་གྱུར་ཅིག །
en: May they become adorned by the Dharma so that they teach the Dharma to beings with continuous and unimpeded eloquence. “ ‘

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་སྣང་བར་གྱུར་པའི་སླད་དུ་སྣང་བས་བརྒྱན་པ་དང་།
en: May they become adorned with light so that they are in the brightness of the Dharma of all the buddhas.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྣང་བར་གྱུར་པའི་སླད་དུ་འོད་ཀྱིས་བརྒྱན་པ་དང་།
en: May they become adorned with radiance so that they are in the brightness of all buddha realms.

source: ཕྱད་པར་ལུང་སྟོན་པའི་སླད་དུ་ཀུན་བརྗོད་པའི་ཆོ་འཕྲུལ་གྱིས་བརྒྱན་པ་དང་།
en: May they become adorned with the miraculous power of foretelling so that they make faultless prophecies.

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྗེས་སུ་སྟོན་པ་སྩོལ་བའི་སླད་དུ་རྗེས་སུ་སྟོན་པའི་ཆོ་འཕྲུལ་གྱིས་བརྒྱན་པ་དང་།
en: May they become adorned with the miraculous power of instruction so that they bestow the appropriate instruction.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞིའི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པའི་སླད་དུ་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གྱིས་བརྒྱན་པ་དང་།
en: May they become adorned with the miracle of miraculous powers so that they attain the highest perfection in the four bases of miraculous powers.

source: དེ་བཞིན་གཤེགས་པའི་གསང་བའི་རྗེས་སུ་ཞུགས་པའི་སླད་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བརྒྱན་པ་དང་།
en: May they become adorned with the blessing of all the tathāgatas so that they enter the secret of all the tathāgatas.

source: གཞན་ལ་རག་མ་ལས་པའི་ཡེ་ཤེས་ཐོབ་པའི་སླད་དུ་ཆོས་ཀྱི་དབང་ཕྱུག་གིས་བརྒྱན་པ་དང་།
en: May they become adorned with sovereignty in the Dharma so that they attain the wisdom that is not dependent on others.

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བགྱིད་ཅིང་ཐམས་ཅད་ཀྱིས་མི་ཆོམས་པའི་སླད་དུ་དགེ་བའི་ཆོས་ཐམས་ཅད་ལ་ནན་ཏན་སྙིང་པོར་བགྱིད་པས་བརྒྱན་པར་གྱུར་ཅིག །
en: May they become adorned with the essence of the practice of all good qualities so that they always practice what they preach and so will never be defeated by anything. “ ‘

source: ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དག་ལ་ཡང་བདག་གིས་ཚིག་གཅིག་བརྗོད་པས་དགེ་བ་རྣམ་པར་སྦྱོང་བ་ཡང་དག་པར་བསྩགས་པ་ཆེན་པོས་ཡང་དག་པར་ཚིམ་པར་གྱུར་ཅིག །
en: Thus, may I, by saying one word to the countless, innumerable beings who have entered the Mahāyāna, bring them satisfaction through great good actions, purification, and accumulation.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་ཆོས་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པའི་ཡེ་ཤེས་ཐོབ་པར་གྱུར་ཅིག །
en: Thereby, may those bodhisattva mahāsattvas attain the wisdom of all dharmas, which is not dependent on others.

source: ཆོས་ཀྱི་སྣང་བ་ཆེན་པོ་དང་ཡང་ལྡན་པར་གྱུར་ཅིག །
en: May they become endowed with the great radiance of the Dharma.

source: མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་གྱུར་ཅིག །
en: May they quickly attain the complete enlightenment of perfect buddhahood. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ན་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའམ། བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོ་པའི་སེམས་ཅན་གང་དག་མཚམས་མ་མཆིས་པ་བགྱིད་པ་དང་། ལྟུང་བའི་རྩ་བའི་བར་གྱི་ནོངས་པ་དང་བཅས་པ་དང་སེམས་ཀྱི་རྒྱུད་ཚིག་པར་གྱུར་པ་དེ་དག་ཀྱང་སྨོན་ལམ་གྱི་དབང་གིས་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་གྱུར་ཅིག །སེམས་ཅན་མི་དགེ་བའི་རྩ་བ་དང་འགྲོགས་པ།
en: Bhadanta Bhagavat, those beings in other world realms who have committed the actions that have an immediate result at death, those who have made the error of the root downfalls, and those whose minds are burning—whether they are of the Śrāvakayāna, the Pratyekabuddhayāna, or the unsurpassable Mahāyāna—may they through the power of prayer be reborn in my buddha realm. “ ‘

source: རྩུབ་པ། སྡིག་པ་འཚལ་བ། ཁྲ་ཁྲོ་དང་། རྨུ་རྒོད་ཀྱི་རྒྱུད་ཅན། བློ་ལྡོག་པ་ཀུན་འཛིན་པའི་རྒྱུད་ཅན་དེ་དག་ལ་ཡང་བདག་གི་སེམས་དང་སྐད་བརྒྱད་ཁྲི་བཞི་སྟོང་དག་སྟོན་པར་གྱུར་ཅིག །
en: May I teach extensively the thoughts and words of the 84,000 Dharma teachings to those beings who are endowed with bad roots, who are rough, who wish to commit bad actions, who have fierce, uncontrollable natures, who have perverse minds, and who are miserly.

source: སེམས་ཅན་ལེ་ལོ་ཅན་གྱི་བར་དག་ལ་ཡང་བདག་གིས་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དག་རྒྱ་ཆེར་སྟོན་པར་གྱུར་ཅིག །
en: May I teach extensively the 84,000 Dharma teachings to beings who are lazy.

source: དེ་ན་སེམས་ཅན་གང་དག་བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོར་གྱུར་པ་དེ་དག་ལ་ཡང་བདག་གིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་ཆོས་རྣམས་རྒྱ་ཆེར་སྟོན་པར་འགྱུར་ཞིང་།
en: May I teach extensively the Dharma of the six perfections to those beings who follow the unsurpassable Mahāyāna.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྒྱ་ཆེར་སྟོན་པར་འགྱུར་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་རྒྱ་ཆེར་སྟོན་པར་གྱུར་ཅིག །
en: May I extensively teach the perfection of generosity, and so on, up to and including the perfection of wisdom. “ ‘

source: ཡང་དེ་ན་སེམས་ཅན་གང་དག་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པར་གྱུར་པའམ། དགེ་བའི་རྩ་བ་མ་བསྐྲུན་ཅིང་བསྟན་བཅོས་ལ་མངོན་པར་དགའ་བར་མ་གྱུར་པ་དེ་དག་ཀྱང་བདག་གིས་གསུམ་ལ་སྐྱབས་སུ་མཆི་བ་ལ་འགོད་པར་འགྱུར་ཞིང་། སླད་ཀྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ལ་ཡང་སྦྱོར་བར་གྱུར་ཅིག །
en: May I establish in taking refuge those beings who are of the Śrāvakayāna or of the Pratyekabuddhayāna, those beings who have not planted good roots, those who are not interested in śāstras, and may I afterward bring them to the practice of the six perfections.

source: རྣམ་པར་འཚེ་བ་ལ་དགའ་བ་རྣམས་ནི་སྲོག་གཅོད་པ་སྤོང་བ་ལ་འགོད་པར་གྱུར་ཅིག །
en: May I cause those who have a love for violence to give up killing.

source: འདོད་པ་མི་བཟད་པས་ཟིལ་གྱིས་ནོན་པ་རྣམས་ནི་མ་བྱིན་པར་ལེན་པ་སྤོང་བ་ལ་འགོད་པར་གྱུར་ཅིག །
en: May I cause those who are overcome by powerful desire to give up taking what has not been given.

source: ཆོས་མ་ལགས་པ་ལ་འདོད་པས་ཆགས་པ་རྣམས་ནི་འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤོང་བ་ལ་འགོད་པར་གྱུར་ཅིག །
en: May I cause those who have a passion for unrighteous pleasures to give up sexual misconduct.

source: ཕན་ཚུན་བརྫུན་གྱི་ཚིག་སྨྲ་བ་རྣམས་ནི་བརྫུན་དུ་སྨྲ་བ་སྤོང་བ་ལ་འགོད་པར་གྱུར་ཅིག །
en: May I cause those who tell each other lies to give up lying.

source: མྱོས་པར་འགྱུར་བ་ལ་མངོན་པར་དགའ་བ་རྣམས་ནི་ཆང་དང་བཅོས་པའི་ཆང་མྱོས་པར་འགྱུར་བ་བག་མེད་པ་སྤོང་བ་ལ་འགོད་པར་གྱུར་ཅིག །
en: May I cause those who enjoy being intoxicated to give up enjoying intoxicating alcoholic drinks.

source: སེམས་ཅན་གང་དག་ནོངས་པ་ལྔ་པོ་ཐམས་ཅད་བགྱིད་པར་འགྱུར་བ་དེ་དག་ནི་ནོངས་པ་ལྔ་པོ་སྤོང་ཞིང་དགེ་བསྙེན་གྱི་སྡོམ་པ་ལ་འགོད་པར་གྱུར་ཅིག །
en: May I cause those beings who commit the five errors to give up the five errors and be established in the upāsaka vows. “ ‘

source: སེམས་ཅན་གང་དག་དགེ་བའི་ཆོས་རྣམས་ལ་མངོན་པར་མི་དགའ་བ་དེ་དག་ནི་བདག་གིས་ཉིན་ཞག་གཅིག་ཙམ་ཡང་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཚུལ་ཁྲིམས་ལ་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །
en: May I cause those beings who take no delight in good qualities to keep the correct conduct of the eight vows day and night.

source: སེམས་ཅན་གང་དག་དགེ་བའི་རྩ་བ་ཆུང་ངུ་ལ་མངོན་པར་དགའ་བའི་སེམས་དང་ལྡན་པ་དེ་དག་ནི་བདག་གིས་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་ཉེ་བར་སྦྱར་བར་བགྱི་ཞིང་། རབ་ཏུ་བྱུང་བའི་སྡོམ་པ་བསླབ་པའི་གཞི་བཅུའི་ཚངས་པར་སྤྱོད་པ་ལ་འགོད་པར་གྱུར་ཅིག །
en: May I bring into the well-proclaimed Dharma and Vinaya those beings who take delight in even limited good roots and establish them in the vows of ordination, the ten bases of the training, and the practice of celibacy.

source: སེམས་ཅན་གང་དག་དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་ཚོལ་བར་འཚལ་བ་དེ་དག་ནི་བདག་གིས་དགེ་བའི་ཆོས་རྣམས་ལ་ཉེ་བར་བསྒྲུབས་ནས་ཚངས་པར་སྦྱོར་བ་ཐམས་ཅད་ལ་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །སེམས་ཅན་མཚམས་མ་མཆིས་པ་བགྱིད་པ་དང་། ཀུན་ནས་འཛིན་པའི་རྒྱུད་ཅན་གྱི་བར་དེ་ལྟ་བུ་དག་གི་དོན་དུ་བདག་གིས་དོན་དང་། ཚིག་དང་།
en: May I bring those beings who seek good qualities to the accomplishment of good qualities, and may I establish them in the complete observance of celibacy.

source: ཡི་གེ་རྣམ་པ་སྣ་ཚོགས་མང་པོ་དག་གི་ཆོ་འཕྲུལ་རྣམས་ཀྱིས་ཆོས་སྟོན་པར་གྱུར་ཅིག །ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་དག་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མ་མཆིས་པ་དང་།
en: May I teach the Dharma through many various kinds of meanings, sentences, words, and miracles for the sake of beings who have committed the actions that have an immediate result at death, and so on, up to and including those who are miserly.

source: སྟོང་པར་སྟོན་པར་འགྱུར་ཞིང་བདེ་བ་དང་། དགེ་བ་དང་། ཞི་བ་དང་། ཤིས་པ་དང་། འཇིགས་པ་མ་མཆིས་པའི་གྲོང་ཁྱེར་མྱ་ངན་ལས་འདས་པ་ལ་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །
en: May I teach impermanence, suffering, no self, emptiness, the aggregates, sensory elements, and sensory bases, and may I establish beings in the good, in the tranquil, in the auspicious, in the peaceful, in the city of fearlessness, in nirvāṇa. “ ‘

source: དེ་ལྟར་བདག་འཁོར་བཞི་པོ་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དག་ལ་ཆོས་སྟོན་པར་གྱུར་ཅིག །
en: In that way, may I teach the Dharma to the fourfold assembly of bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās.

source: གང་དག་རྩོད་པ་འཚལ་བར་འགྱུར་བ་དེ་དག་ལ་བདག་གིས་ཆོས་ཀྱིས་བརྩད་པའི་བསྟན་བཅོས་རབ་ཏུ་སྟོན་པར་གྱུར་ཅིག །
en: May I show the science of debating in accordance with the Dharma to those who wish to debate.

source: གང་དག་དགེ་བའི་ཆོས་རྣམས་ལ་མངོན་པར་མི་དགའ་བ་དེ་དག་ལ་བདག་གིས་ཞལ་ཏ་བགྱིད་པའི་ལས་སྟོན་པར་གྱུར་ཅིག །
en: May I assign duties to those who do not take pleasure in virtuous qualities.

source: ཁ་ཏོན་ལ་མངོན་པར་དགའ་བ་རྣམས་ལ་ནི་སྟོང་པ་ཉིད་ཀྱིས་བསམ་གཏན་གྱི་ཆ་གཅིག་གིས་རྣམ་པར་གྲོལ་བའི་ལམ་སྟོན་པར་གྱུར་ཅིག །
en: May I give the condensed teaching of emptiness and the path of liberation through meditation to those who delight in daily recitation.

source: སེམས་ཅན་རེ་རེའི་དོན་གྱི་སླད་དུ་ཡང་བདག་དཔག་ཚད་འབུམ་ཕྲག་མང་པོ་དག་ཏུ་སུག་པས་མཆི་བར་འགྱུར་ཞིང་། དོན་དང་།
en: May I walk many hundreds of thousands of yojanas for the sake of each single being.

source: ཚིག་དང་། ཡི་གེ་དང་། ཐབས་དང་། ཆོ་འཕྲུལ་རྣམ་པ་སྣ་ཚོགས་མང་པོ་དག་གིས་སྐྱོ་བ་མ་མཆིས་ཤིང་སྤྲོ་བར་བགྱིད་པར་འགྱུར་བ་དང་། མྱ་ངན་ལས་འདས་པའི་བར་ལ་འགོད་པར་གྱུར་ཅིག །
en: May I exert myself unwearyingly through many various kinds of meanings, sentences, words, methods, and miracles, until I establish them in nirvāṇa. “ ‘

source: ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱིས་བདག་གི་ཚེའི་འདུ་བྱེད་ཇི་ཙམ་པའི་ལྔ་ཆ་འདོར་བར་གྱུར་ཅིག །
en: May I cast aside through the power of samādhi a fifth of this life’s activities.

source: བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་དུས་ཀྱི་ཚེ་ན་རང་གི་སྐུ་གདུང་བདག་ཉིད་ཀྱིས་ཡུངས་འབྲུའི་ཚད་ཙམ་དུ་གཅོག་པར་འགྱུར་ཞིང་།
en: At the time of parinirvāṇa, may I divide my body into pieces the size of mustard seeds.

source: སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེའི་སླད་དུ་བདག་ནི་སླད་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གྱུར་ཅིག །
en: May I afterward make myself pass into parinirvāṇa out of compassion for beings.
